<?php
// สร้างอาร์เรย์ที่เก็บข้อมูล
$pricingBoxes = [
    [
        'image' => '../public/img/expense.jpg',
        'title' => 'NEED',
        'description' => 'ระบบที่จะช่วยบันทึกการยื่นขอความต้องการต่างๆ ภายในองค์กร ไม่ว่าจะเป็น การเบิกค่าใช้จ่ายหรือการสั่งซื้อต่างๆ สามารถทำได้ง่ายๆเพียงบันทึก และรอการอนุมัติผ่านระบบ',
    ],
    [
        'image' => '../public/img/expense.jpg',
        'title' => 'NEED',
        'description' => 'ระบบที่จะช่วยบันทึกการยื่นขอความต้องการต่างๆ ภายในองค์กร ไม่ว่าจะเป็น การเบิกค่าใช้จ่ายหรือการสั่งซื้อต่างๆ สามารถทำได้ง่ายๆเพียงบันทึก และรอการอนุมัติผ่านระบบ',
    ],
    [
        'image' => '../public/img/expense.jpg',
        'title' => 'NEED',
        'description' => 'ระบบที่จะช่วยบันทึกการยื่นขอความต้องการต่างๆ ภายในองค์กร ไม่ว่าจะเป็น การเบิกค่าใช้จ่ายหรือการสั่งซื้อต่างๆ สามารถทำได้ง่ายๆเพียงบันทึก และรอการอนุมัติผ่านระบบ',
    ],
    // [
    //     'image' => '../public/img/expense.jpg',
    //     'title' => 'NEED',
    //     'description' => 'ระบบที่จะช่วยบันทึกการยื่นขอความต้องการต่างๆ ภายในองค์กร ไม่ว่าจะเป็น การเบิกค่าใช้จ่ายหรือการสั่งซื้อต่างๆ สามารถทำได้ง่ายๆเพียงบันทึก และรอการอนุมัติผ่านระบบ',
    // ],
    // [
    //     'image' => '../public/img/expense.jpg',
    //     'title' => 'NEED',
    //     'description' => 'ระบบที่จะช่วยบันทึกการยื่นขอความต้องการต่างๆ ภายในองค์กร ไม่ว่าจะเป็น การเบิกค่าใช้จ่ายหรือการสั่งซื้อต่างๆ สามารถทำได้ง่ายๆเพียงบันทึก และรอการอนุมัติผ่านระบบ',
    // ]
];

?>

<div class="content-pricing">
    <?php foreach ($pricingBoxes as $box): ?>
        <div class="box-pricing">
            <img src="<?php echo $box['image']; ?>" alt="">
            <h6><?php echo $box['title']; ?></h6>
            <p class="line-clamp"><?php echo $box['description']; ?></p>
            <div>
                <button type="button" class="btn btn-warning">อ่านเพิ่มเติม</button>
            </div> 
        </div>
    <?php endforeach; ?>
</div>
